In [1]:
import os

In [2]:
os.getcwd()

'C:\\Users\\Encaion\\Desktop\\python_class'

In [3]:
os.listdir()

['.ipynb_checkpoints',
 '01_DX_Class_Data_Set.zip',
 '02_Test_Data_Set',
 '02_Test_Data_Set.zip',
 'bike.csv',
 'classification_data_01.csv',
 'class_230322.ipynb',
 'diamonds.csv',
 'edu_enrollees.csv',
 'elec_load_2017_7d.csv',
 'iris.csv',
 'iris_missing.csv',
 'krx_202105_cp949.csv',
 'krx_202105_utf8.csv',
 'linear_regression_01.csv',
 'logistic_regression_01.csv',
 'test1.ipynb']

In [4]:
import pandas as pd

In [5]:
df_1 = pd.DataFrame(dict(obs = [1, 2, 3],
                         col2 = ["a1", "b2", "cba"],
                         col3 = [100, 200, 300]))
df_1

   obs col2  col3
0    1   a1   100
1    2   b2   200
2    3  cba   300

In [6]:
df_1.iloc[:2, ]

   obs col2  col3
0    1   a1   100
1    2   b2   200

In [7]:
df_1.loc[:2, ]

   obs col2  col3
0    1   a1   100
1    2   b2   200
2    3  cba   300

In [8]:
df_1.iloc[:, 1:]

  col2  col3
0   a1   100
1   b2   200
2  cba   300

In [9]:
df_1["shape"] = "bb"
df_1

   obs col2  col3 shape
0    1   a1   100    bb
1    2   b2   200    bb
2    3  cba   300    bb

In [10]:
df_1.obs

0    1
1    2
2    3
Name: obs, dtype: int64

In [11]:
df_1.shape

(3, 4)

In [12]:
df_1["shape"]

0    bb
1    bb
2    bb
Name: shape, dtype: object

In [13]:
df_1["col2"][1]

'b2'

In [14]:
df_1.loc[1, "col2"]

'b2'

In [15]:
df_1.columns = df_1.columns.str.upper()
df_1

   OBS COL2  COL3 SHAPE
0    1   a1   100    bb
1    2   b2   200    bb
2    3  cba   300    bb

In [16]:
df_1.columns = df_1.columns.str.lower()
df_1

   obs col2  col3 shape
0    1   a1   100    bb
1    2   b2   200    bb
2    3  cba   300    bb

In [17]:
df_1.loc[:, df_1.columns.str.contains(pat = "^col")]

  col2  col3
0   a1   100
1   b2   200
2  cba   300

In [18]:
df_1.loc[df_1["col2"] == "b2", ]

   obs col2  col3 shape
1    2   b2   200    bb

In [19]:
df_1.loc[(df_1["col2"] == "b2") | (df_1["obs"] == 3), ]

   obs col2  col3 shape
1    2   b2   200    bb
2    3  cba   300    bb

In [20]:
df_1.loc[(df_1["col2"] == "b2") & (df_1["obs"] == 3), ]

Empty DataFrame
Columns: [obs, col2, col3, shape]
Index: []

In [21]:
# df_1.loc[df_1["col2"] == "b2", ]
df_1["col2"] == "b2"

0    False
1     True
2    False
Name: col2, dtype: bool

In [22]:
~(df_1["col2"] == "b2")

0     True
1    False
2     True
Name: col2, dtype: bool

In [23]:
df_1.loc[~(df_1["col2"] == "b2"), ]

   obs col2  col3 shape
0    1   a1   100    bb
2    3  cba   300    bb

In [24]:
df_1.loc[(df_1["col3"] == 100) | (df_1["col3"] == 300), ]

   obs col2  col3 shape
0    1   a1   100    bb
2    3  cba   300    bb

In [25]:
df_1.loc[df_1["col3"].isin([100, 300]), ]

   obs col2  col3 shape
0    1   a1   100    bb
2    3  cba   300    bb

In [26]:
df = pd.read_csv("krx_202105_utf8.csv")
df.head(2)

,지수명,종가,대비,등락률,시가,고가,저가,거래량,거래대금,상장시가총액,날짜
0,KRX 300,1901.05,-11.63,-0.61,1913.15,1929.94,1896.65,279548840,13488481375036,2028800954161500,20210503
1,KTOP 30,11520.28,-86.30,-0.74,11609.44,11702.14,11490.84,50048566,5645660149606,1208343758559140,20210503

In [27]:
df_sub = df.loc[df["지수명"] == "KRX 300", ]
df_sub.head(2)

,지수명,종가,대비,등락률,시가,고가,저가,거래량,거래대금,상장시가총액,날짜
0,KRX 300,1901.05,-11.63,-0.61,1913.15,1929.94,1896.65,279548840,13488481375036,2028800954161500,20210503
29,KRX 300,1916.40,15.35,0.81,1903.57,1916.40,1892.36,244040965,11708937073166,2043945386926060,20210504

In [28]:
df["지수명"].unique()

array(['KRX 300', 'KTOP 30', 'KRX 100', 'KRX Mid 200', 'KRX 자동차',
       'KRX 반도체', 'KRX 헬스케어', 'KRX 은행', 'KRX 에너지화학', 'KRX 철강', 'KRX 방송통신',
       'KRX 건설', 'KRX 증권', 'KRX 기계장비', 'KRX 보험', 'KRX 운송', 'KRX 경기소비재',
       'KRX 필수소비재', 'KRX 미디어&엔터테인먼트', 'KRX 정보기술', 'KRX 유틸리티',
       'KRX 300 정보기술', 'KRX 300 금융', 'KRX 300 자유소비재', 'KRX 300 산업재',
       'KRX 300 헬스케어', 'KRX 300 커뮤니케이션서비스', 'KRX 300 소재', 'KRX 300 필수소비재'],
      dtype=object)

In [29]:
df.loc[df["종가"] == df["종가"].max(), ["지수명", "종가", "날짜"]]

         지수명        종가        날짜
117  KTOP 30  11869.29  20210510

In [30]:
df.loc[df["종가"].idxmax(), ["지수명", "종가", "날짜"]]

지수명     KTOP 30
종가     11869.29
날짜     20210510
Name: 117, dtype: object

In [31]:
df.loc[[df["종가"].idxmax()], ["지수명", "종가", "날짜"]]

         지수명        종가        날짜
117  KTOP 30  11869.29  20210510

In [32]:
df = pd.read_csv("iris_missing.csv")
df_sub = df.head()
df_sub

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [33]:
df_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  5 non-null      float64
 1   Sepal.Width   4 non-null      float64
 2   Petal.Length  4 non-null      float64
 3   Petal.Width   5 non-null      float64
 4   Species       5 non-null      object
dtypes: float64(4), object(1)
memory usage: 328.0+ bytes

In [34]:
df_sub.count()

Sepal.Length    5
Sepal.Width     4
Petal.Length    4
Petal.Width     5
Species         5
dtype: int64

In [35]:
df_sub.isna().sum()

Sepal.Length    0
Sepal.Width     1
Petal.Length    1
Petal.Width     0
Species         0
dtype: int64

In [36]:
df_sub.isna()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width  Species
0         False         True          True        False    False
1         False        False         False        False    False
2         False        False         False        False    False
3         False        False         False        False    False
4         False        False         False        False    False

In [37]:
df_sub.dropna()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [38]:
df_sub["Sepal.Width"].mean() # 결측이 있어도 경고나 에러 없이 동작함.

3.225

In [39]:
df_sub["Sepal.Width"] = df_sub["Sepal.Width"].fillna(df_sub["Sepal.Width"].mean())
df_sub

C:\Users\Encaion\AppData\Local\Temp\ipykernel_14884\354970801.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_sub["Sepal.Width"] = df_sub["Sepal.Width"].fillna(df_sub["Sepal.Width"].mean())

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1        3.225           NaN          0.2  setosa
1           4.9        3.000           1.4          0.2  setosa
2           4.7        3.200           1.3          0.2  setosa
3           4.6        3.100           1.5          0.2  setosa
4           5.0        3.600           1.4          0.2  setosa

In [40]:
# df_sub2 = df.head().copy()
df_sub2 = df.head().reset_index(drop = True)
df_sub2["Sepal.Width"] = df_sub2["Sepal.Width"].fillna(df_sub2["Sepal.Width"].mean())

In [41]:
df_sub2

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1        3.225           NaN          0.2  setosa
1           4.9        3.000           1.4          0.2  setosa
2           4.7        3.200           1.3          0.2  setosa
3           4.6        3.100           1.5          0.2  setosa
4           5.0        3.600           1.4          0.2  setosa

In [42]:
df.isna().sum()

Sepal.Length     7
Sepal.Width     13
Petal.Length    14
Petal.Width      6
Species          0
dtype: int64

In [43]:
df = df.fillna(0)
df.isna().sum()

Sepal.Length    0
Sepal.Width     0
Petal.Length    0
Petal.Width     0
Species         0
dtype: int64

In [44]:
df.head(2)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          0.0           0.0          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [45]:
df.iloc[:, [4, 0, 1, 2, 3]].head(2)

  Species  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0  setosa           5.1          0.0           0.0          0.2
1  setosa           4.9          3.0           1.4          0.2

In [46]:
import numpy as np

In [47]:
df.iloc[:, np.r_[4, 0:4]].head(2)

  Species  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0  setosa           5.1          0.0           0.0          0.2
1  setosa           4.9          3.0           1.4          0.2

In [48]:
df.set_index("Species").reset_index()

       Species  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0       setosa           5.1          0.0           0.0          0.2
1       setosa           4.9          3.0           1.4          0.2
2       setosa           4.7          3.2           1.3          0.2
3       setosa           4.6          3.1           1.5          0.2
4       setosa           5.0          3.6           1.4          0.2
..         ...           ...          ...           ...          ...
145  virginica           6.7          3.0           5.2          2.3
146  virginica           0.0          2.5           0.0          0.0
147  virginica           6.5          3.0           5.2          2.0
148  virginica           6.2          3.4           5.4          2.3
149  virginica           5.9          3.0           5.1          0.0

[150 rows x 5 columns]

In [49]:
?np.r_

In [50]:
ser = pd.Series([100, 200, 300])
ser

0    100
1    200
2    300
dtype: int64

In [51]:
"aa" + "bb"

'aabb'

In [52]:
# ser + "원"
ser.astype("str") + "원"

0    100원
1    200원
2    300원
dtype: object

In [53]:
df.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [54]:
df = pd.read_csv("bike.csv")

In [55]:
df["season"].unique()

array([1, 2, 3, 4], dtype=int64)

In [56]:
# len(df["season"].unique())
df["season"].nunique()

4

In [57]:
df["season"].value_counts()

4    2734
2    2733
3    2733
1    2686
Name: season, dtype: int64

In [58]:
df["season"].value_counts(normalize = True)

4    0.251148
2    0.251056
3    0.251056
1    0.246739
Name: season, dtype: float64

In [59]:
pd.crosstab(df["season"], df["holiday"])

holiday     0   1
season
1        2615  71
2        2685  48
3        2637  96
4        2638  96

In [60]:
df_sub = df.loc[(df["season"] == 1) & (df["holiday"] == 0), ]
len(df_sub)

2615

In [61]:
sum((df["season"] == 1) & (df["holiday"] == 0))

2615

In [62]:
pd.crosstab(df["season"], df["holiday"], normalize = True)

holiday         0         1
season
1        0.240217  0.006522
2        0.246647  0.004409
3        0.242238  0.008819
4        0.242330  0.008819

In [63]:
pd.crosstab(df["season"], df["holiday"], normalize = "index")

holiday         0         1
season
1        0.973567  0.026433
2        0.982437  0.017563
3        0.964874  0.035126
4        0.964887  0.035113

In [64]:
pd.crosstab(df["season"], df["holiday"], normalize = "columns")

holiday         0         1
season
1        0.247281  0.228296
2        0.253901  0.154341
3        0.249362  0.308682
4        0.249456  0.308682

In [65]:
pd.crosstab(index = df["season"], columns = df["holiday"], 
            values = df["count"], aggfunc = "mean")

holiday           0           1
season
1        117.494837   73.929577
2        215.562756  197.833333
3        234.293136  237.822917
4        198.560273  210.750000

In [66]:
# df.groupby(["season", "holiday"])["count", "casual"].mean()
df.groupby(["season", "holiday"])[["count", "casual"]].mean()

                     count     casual
season holiday
1      0        117.494837  15.689101
       1         73.929577   8.140845
2      0        215.562756  47.609683
       1        197.833333  38.333333
3      0        234.293136  50.773606
       1        237.822917  91.958333
4      0        198.560273  28.133055
       1        210.750000  40.885417

In [67]:
age_g = pd.Series([5, 10, 11, 15, 20, 23, 30, 45])

In [68]:
pd.cut(age_g, bins = [10, 20, 30])

0             NaN
1             NaN
2    (10.0, 20.0]
3    (10.0, 20.0]
4    (10.0, 20.0]
5    (20.0, 30.0]
6    (20.0, 30.0]
7             NaN
dtype: category
Categories (2, interval[int64, right]): [(10, 20] < (20, 30]]

In [69]:
pd.cut(age_g, bins = [10, 20, 30], right = False)

0             NaN
1    [10.0, 20.0)
2    [10.0, 20.0)
3    [10.0, 20.0)
4    [20.0, 30.0)
5    [20.0, 30.0)
6             NaN
7             NaN
dtype: category
Categories (2, interval[int64, left]): [[10, 20) < [20, 30)]

In [70]:
pd.cut(age_g, bins = [10, 20, 30], right = False, labels = ["a", "b"])

0    NaN
1      a
2      a
3      a
4      b
5      b
6    NaN
7    NaN
dtype: category
Categories (2, object): ['a' < 'b']

In [71]:
pd.cut(age_g, bins = [0, 10, 20, 30, 100], right = False)

0      [0, 10)
1     [10, 20)
2     [10, 20)
3     [10, 20)
4     [20, 30)
5     [20, 30)
6    [30, 100)
7    [30, 100)
dtype: category
Categories (4, interval[int64, left]): [[0, 10) < [10, 20) < [20, 30) < [30, 100)]

In [72]:
df.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [73]:
df2 = df.loc[:100, ["datetime", "temp"]].copy()
df2.head(2)

              datetime  temp
0  2011-01-01 00:00:00  9.84
1  2011-01-01 01:00:00  9.02

In [74]:
df2["datetime"] = pd.to_datetime(df2["datetime"])
df2["date"] = df2["datetime"].dt.date
df2.head(2)

             datetime  temp        date
0 2011-01-01 00:00:00  9.84  2011-01-01
1 2011-01-01 01:00:00  9.02  2011-01-01

In [75]:
df2_agg = df2.groupby("date")["temp"].max().reset_index()
df2_agg["temp_1s"] = df2_agg["temp"].shift(1)
df2_agg["diff"] = df2_agg["temp"] - df2_agg["temp_1s"]
df2_agg.head()

         date   temp  temp_1s  diff
0  2011-01-01  18.86      NaN   NaN
1  2011-01-02  18.86    18.86  0.00
2  2011-01-03  10.66    18.86 -8.20
3  2011-01-04  12.30    10.66  1.64
4  2011-01-05   9.84    12.30 -2.46

In [97]:
df2_agg_sub = df2_agg.loc[:, :"temp"]
df2.merge(df2_agg_sub, on = "date")

               datetime  temp_x        date  temp_y
0   2011-01-01 00:00:00    9.84  2011-01-01   18.86
1   2011-01-01 01:00:00    9.02  2011-01-01   18.86
2   2011-01-01 02:00:00    9.02  2011-01-01   18.86
3   2011-01-01 03:00:00    9.84  2011-01-01   18.86
4   2011-01-01 04:00:00    9.84  2011-01-01   18.86
..                  ...     ...         ...     ...
96  2011-01-05 05:00:00    9.02  2011-01-05    9.84
97  2011-01-05 06:00:00    8.20  2011-01-05    9.84
98  2011-01-05 07:00:00    7.38  2011-01-05    9.84
99  2011-01-05 08:00:00    8.20  2011-01-05    9.84
100 2011-01-05 09:00:00    9.02  2011-01-05    9.84

[101 rows x 4 columns]

In [76]:
df2_agg_sub = df2_agg.loc[:, :"temp"]
df2_agg_sub = df2_agg_sub.rename(columns = {"temp": "temp_max"})
df2_agg_sub

         date  temp_max
0  2011-01-01     18.86
1  2011-01-02     18.86
2  2011-01-03     10.66
3  2011-01-04     12.30
4  2011-01-05      9.84

In [77]:
df2_join = df2.merge(df2_agg_sub, on = "date")
df2_join.head(2)

             datetime  temp        date  temp_max
0 2011-01-01 00:00:00  9.84  2011-01-01     18.86
1 2011-01-01 01:00:00  9.02  2011-01-01     18.86

In [78]:
df = pd.DataFrame(dict(col1 = [1, 2, 3],
                       col2 = ["aa", "abc", "eea"],
                       col3 = ["abc@gmail.com", "a@b@c", "ddd}"]))
df

   col1 col2           col3
0     1   aa  abc@gmail.com
1     2  abc          a@b@c
2     3  eea           ddd}

In [79]:
df["col2"].replace("a", "b")

0     aa
1    abc
2    eea
Name: col2, dtype: object

In [80]:
df["col2"].str.replace("a", "b")

0     bb
1    bbc
2    eeb
Name: col2, dtype: object

In [81]:
df["col2"].replace("aa", "b")

0      b
1    abc
2    eea
Name: col2, dtype: object

In [82]:
df["col2"].replace({"aa": "bb", "abc": "cc"})

0     bb
1     cc
2    eea
Name: col2, dtype: object

In [83]:
df["col2"].str.contains("b")

0    False
1     True
2    False
Name: col2, dtype: bool

In [84]:
df.loc[df["col2"].str.contains("b"), ]

   col1 col2   col3
1     2  abc  a@b@c

In [85]:
df.loc[~df["col2"].str.contains("b"), ]

   col1 col2           col3
0     1   aa  abc@gmail.com
2     3  eea           ddd}

In [86]:
# pd.Series.str.contains()

In [87]:
df.loc[df["col2"].str.contains("b"), ]

   col1 col2   col3
1     2  abc  a@b@c

In [88]:
df.loc[df["col2"].str.contains("a$"), ] # a로 끝나는

   col1 col2           col3
0     1   aa  abc@gmail.com
2     3  eea           ddd}

In [89]:
df["col3"].str.split("@")

0    [abc, gmail.com]
1           [a, b, c]
2              [ddd}]
Name: col3, dtype: object

In [90]:
df["col3"].str.split("@", expand = True)

      0          1     2
0   abc  gmail.com  None
1     a          b     c
2  ddd}       None  None

In [91]:
pd.concat([df, df["col3"].str.split("@", expand = True)])

   col1 col2           col3     0          1     2
0   1.0   aa  abc@gmail.com   NaN        NaN   NaN
1   2.0  abc          a@b@c   NaN        NaN   NaN
2   3.0  eea           ddd}   NaN        NaN   NaN
0   NaN  NaN            NaN   abc  gmail.com  None
1   NaN  NaN            NaN     a          b     c
2   NaN  NaN            NaN  ddd}       None  None

In [92]:
pd.concat([df, df["col3"].str.split("@", expand = True)], axis = 1)

   col1 col2           col3     0          1     2
0     1   aa  abc@gmail.com   abc  gmail.com  None
1     2  abc          a@b@c     a          b     c
2     3  eea           ddd}  ddd}       None  None

In [93]:
df["col3"].str.split("@").explode().reset_index()

   index       col3
0      0        abc
1      0  gmail.com
2      1          a
3      1          b
4      1          c
5      2       ddd}

In [94]:
df["col2"].str.len()

0    2
1    3
2    3
Name: col2, dtype: int64

In [95]:
df["col2"].str.replace("a", "") # 문자 "a"를 제거

0
1    bc
2    ee
Name: col2, dtype: object

In [96]:
pd.to_datetime()

TypeError: to_datetime() missing 1 required positional argument: 'arg'

In [ ]:
bike = pd.read_csv("bike.csv")
bike = bike[["datetime", "casual"]].copy()
bike.head(2)

In [ ]:
bike.dtypes

In [ ]:
bike["datetime"] = pd.to_datetime(bike["datetime"])
bike.dtypes

In [ ]:
ser_t = pd.Series([100, 130, 200, 500])
pd.to_datetime(ser_t, origin = "2023-03-22 10:00:00", unit = "ms")

In [ ]:
bike["year" ] = bike["datetime"].dt.year
bike["month"] = bike["datetime"].dt.month
bike["hour" ] = bike["datetime"].dt.hour
bike["wday" ] = bike["datetime"].dt.weekday
bike["is_wend"] = np.where(bike["wday"] >= 5, 1, 0) # 1
bike["is_wend"] = (bike["wday"] >= 5).astype("int") # 2
bike["is_wend"] = (bike["wday"] >= 5) + 0 # 3
bike["is_wend"] = (bike["wday"] >= 5) * 1 # 4
bike.head(2)

In [ ]:
elec = pd.read_csv("elec_load_2017_7d.csv")
elec.head(2)

In [ ]:
elec.shape

In [ ]:
elec.iloc[0, ].reset_index()

In [ ]:
elec.loc[:1, "X7HR":"X15HR"]

In [ ]:
elec_melt = elec.melt(id_vars = ["YEAR", "MONTH", "DAY"])
elec_melt.head(2)

In [ ]:
elec_melt = elec_melt.rename(columns = {"variable": "HOUR", "value": "LOAD"})
elec_melt.head(3)

In [ ]:
elec_melt["HOUR"] = elec_melt["HOUR"].str.replace("X|HR", "", regex = True)
elec_melt["HOUR"] = elec_melt["HOUR"].astype("int")
elec_melt.head(2)

In [ ]:
elec_melt.dtypes

In [ ]:
elec_melt.shape

In [ ]:
elec_pivot = elec_melt.pivot(index = ["YEAR", "MONTH", "DAY"],
                             columns = "HOUR",
                             values = "LOAD").reset_index()
elec_pivot.head(2)

In [98]:
df = pd.read_csv("bike.csv")
df.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [103]:
# df.iloc[:, 1:5].mean(axis = 0)
# df.iloc[:, 1:5].mean(axis = 1)
df.iloc[:, 1:5].apply(lambda x: round(x.mean(), 1) + 100)

season        102.5
holiday       100.0
workingday    100.7
weather       101.4
dtype: float64

In [104]:
x = df["season"]
round(x.mean(), 1) + 100

102.5

In [106]:
df_s = pd.DataFrame(dict(obs = [1, 2, 3],
                         cost = ["123$", "22,000원", "1.23원"]))
df_s

   obs     cost
0    1     123$
1    2  22,000원
2    3    1.23원

In [114]:
# df_s["cost"].str.replace("\$|,|원", "", regex = True)
df_s["cost"].str.replace("\$|,|원", "", regex = True).astype("float")

0      123.00
1    22000.00
2        1.23
Name: cost, dtype: float64

In [115]:
df_s["cost"].str.replace(".", "", regex = True)

0       123$
1    22,000원
2       123원
Name: cost, dtype: object

In [112]:
# df_s["cost"].str.replace("[^0-9]", "", regex = True)
df_s["cost"].str.replace("[^0-9.]", "", regex = True) # 숫자와 마침표를 제외한 나머지

0      123
1    22000
2     1.23
Name: cost, dtype: object

### 모델 만들어보기

In [118]:
dia = pd.read_csv("diamonds.csv")
dia.head(2)

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31

In [122]:
# dia_dum = pd.get_dummies(dia, columns = ["cut", "color", "clarity"])
dia_dum = pd.get_dummies(dia)
dia_dum = dia_dum.set_index("price").reset_index()
dia_dum.head(2)

,carat,depth,table,price,x,y,z,cut_Fair,cut_Good,cut_Ideal,...,color_I,color_J,clarity_I1,clarity_IF,clarity_SI1,clarity_SI2,clarity_VS1,clarity_VS2,clarity_VVS1,clarity_VVS2
0,0.23,61.5,55.0,326,3.95,3.98,2.43,0,0,1,...,0,0,0,0,0,1,0,0,0,0
1,0.21,59.8,61.0,326,3.89,3.84,2.31,0,0,0,...,0,0,0,0,1,0,0,0,0,0

In [124]:
from sklearn.model_selection import train_test_split
df_train, df_test = train_test_split(dia_dum, train_size = 0.7, random_state = 123)
len(df_train), len(df_test)

(37758, 16182)

In [129]:
from sklearn.preprocessing import StandardScaler
model_nor = StandardScaler().fit(df_train)
arr_train_nor = model_nor.transform(df_train)
arr_test_nor  = model_nor.transform(df_test)

In [ ]:
# arr_train_nor = StandardScaler().fit_transform(df_train)
# arr_test_nor  = StandardScaler().fit_transform(df_test)

In [131]:
arr_train_nor[:1, ]

array([[ 0.43363556,  0.55116139, -0.87705508, -0.20503673,  0.79886224,
         0.74694202,  0.64630735, -0.17532299, -0.31549021,  1.22381281,
        -0.58809553, -0.53465899, -0.37898197, -0.47353952, -0.46049648,
        -0.51314363,  2.33829551, -0.33637566, -0.23323424, -0.11736124,
        -0.18473161, -0.56534058, -0.45452802, -0.42188442,  1.83758653,
        -0.26946152, -0.31968436]])

In [133]:
df_train_nor = pd.DataFrame(arr_train_nor, columns = df_train.columns)
df_test_nor  = pd.DataFrame(arr_test_nor,  columns = df_test.columns)
df_train_nor.head(1)

,price,carat,depth,table,x,y,z,cut_Fair,cut_Good,cut_Ideal,...,color_I,color_J,clarity_I1,clarity_IF,clarity_SI1,clarity_SI2,clarity_VS1,clarity_VS2,clarity_VVS1,clarity_VVS2
0,0.433636,0.551161,-0.877055,-0.205037,0.798862,0.746942,0.646307,-0.175323,-0.31549,1.223813,...,-0.336376,-0.233234,-0.117361,-0.184732,-0.565341,-0.454528,-0.421884,1.837587,-0.269462,-0.319684

In [136]:
from sklearn.neighbors import KNeighborsRegressor

model_knn = KNeighborsRegressor(n_neighbors = 9)
model_knn.fit(X = df_train_nor.drop(columns = "price"),
              y = df_train_nor["price"])
pred = model_knn.predict(df_test_nor.drop(columns = "price"))
pred[:5]

array([-0.78979706, -0.75146984,  0.59413601, -0.74433401, -0.20287497])

In [140]:
from sklearn.metrics import mean_squared_error
round(mean_squared_error(y_true = df_test_nor["price"],
                         y_pred = pred) ** 0.5, 2)

0.23

In [141]:
df_test.head(2)

,price,carat,depth,table,x,y,z,cut_Fair,cut_Good,cut_Ideal,...,color_I,color_J,clarity_I1,clarity_IF,clarity_SI1,clarity_SI2,clarity_VS1,clarity_VS2,clarity_VVS1,clarity_VVS2
32685,802,0.31,63.0,57.0,4.32,4.28,2.71,0,0,0,...,0,0,0,0,0,0,1,0,0,0
36258,935,0.46,61.3,55.0,4.98,5.00,3.06,0,0,1,...,0,0,0,0,0,1,0,0,0,0

In [145]:
df_test1 = df_test.head(1).copy()
df_test1

,price,carat,depth,table,x,y,z,cut_Fair,cut_Good,cut_Ideal,...,color_I,color_J,clarity_I1,clarity_IF,clarity_SI1,clarity_SI2,clarity_VS1,clarity_VS2,clarity_VVS1,clarity_VVS2
32685,802,0.31,63.0,57.0,4.32,4.28,2.71,0,0,0,...,0,0,0,0,0,0,1,0,0,0

In [146]:
df_test1["carat"] = 0.5
df_test1["depth"] = 75
df_test1["cut_Good"] = 1
df_test1["cut_Premium"] = 0

In [147]:
df_test1

,price,carat,depth,table,x,y,z,cut_Fair,cut_Good,cut_Ideal,...,color_I,color_J,clarity_I1,clarity_IF,clarity_SI1,clarity_SI2,clarity_VS1,clarity_VS2,clarity_VVS1,clarity_VVS2
32685,802,0.5,75,57.0,4.32,4.28,2.71,0,1,0,...,0,0,0,0,0,0,1,0,0,0

In [151]:
arr_test1_nor = model_nor.transform(df_test1)
df_test1_nor = pd.DataFrame(arr_test1_nor, columns = df_test1.columns)

In [152]:
pred1 = model_knn.predict(df_test1_nor.iloc[:, 1:])
pred1

array([-0.45184857])

In [156]:
# model_nor.inverse_transform(pred1)
# model_nor.inverse_transform(pd.DataFrame(dict(price = pred1)))
df_test1_nor["price"] = pred1
df_test1_nor

,price,carat,depth,table,x,y,z,cut_Fair,cut_Good,cut_Ideal,...,color_I,color_J,clarity_I1,clarity_IF,clarity_SI1,clarity_SI2,clarity_VS1,clarity_VS2,clarity_VVS1,clarity_VVS2
0,-0.451849,-0.632025,9.303212,-0.205037,-1.261399,-1.264256,-1.170381,-0.175323,3.16967,-0.817118,...,-0.336376,-0.233234,-0.117361,-0.184732,-0.565341,-0.454528,2.370317,-0.544192,-0.269462,-0.319684

In [159]:
arr_inv = model_nor.inverse_transform(df_test1_nor)
arr_inv[0, 0]

2139.333333333333